<?php

Route::get('test', function() {
    $govornorates = [
        'القاهرة',
        'الجيزة',
        'الأسكندرية',
        'الدقهلية',
        'البحر الأحمر',
        'البحيرة',
        'الفيوم',
        'الغربية',
        'الإسماعلية',
        'المنوفية',
        'المنيا',
        'القليوبية',
        'الوادي الجديد',
        'السويس',
        'اسوان',
        'اسيوط',
        'بني سويف',
        'بورسعيد',
        'دمياط',
        'الشرقية',
        'جنوب سيناء',
        'كفر الشيخ',
        'مطروح',
        'الأقصر',
        'قنا',
        'شمال سيناء',
        'سوهاج',
    ];

    $data = collect($govornorates)->map(function ($g, $index) {
        return [
            'id' => $index+1,
            'name' => $g,
        ];
    })->toArray();

});
